app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a"], ["body", "a"], ["created_at", "2020-12-16 06:23:54.442907"], ["updated_at", "2020-12-16 06:23:54.442907"]]
SELECT "books".* FROM "books"
---
  def create
   @book = Book.new(book_params)
  if @book.save
    flash[:notice] = "Book was successfully created."
   redirect_to book_path(@book)
  else
      @books = Book.all